views/document-order/index.php

                return ['class' => 'default'];
        },
        'summary' => false,
        'columns' => [
            ['attribute' => 'order_date', 'label' => 'Дата приказа'],
            'documentNumberString',
            ['attribute' => 'order_name', 'label' => 'Наименование приказа'],
            ['attribute' => 'bringName','label' => 'Проект вносит', 'value' => function ($model) {
                return $model->bring->secondname.' '.mb_substr($model->bring->firstname, 0, 1).'.'.mb_substr($model->bring->patronymic, 0, 1).'.';
            },
            ],
            ['attribute' => 'executorName','label' => 'Исполнитель', 'value' => function ($model) {
                return $model->executor->secondname.' '.mb_substr($model->executor->firstname, 0, 1).'.'.mb_substr($model->executor->patronymic, 0, 1).'.';
            },
            ],

            ['attribute' => 'responsibilities','label' => 'Ответственные', 'contentOptions' => ['encode' => 'false'], 'value' => function ($model) {
                $tmp = \app\models\common\Responsible::find()->where(['document_order_id' => $model->id])->all();
                $result = '';
                for ($i = 0; $i < count($tmp); $i++)
                    $result = $result.$tmp[$i]->people->secondname.' '.mb_substr($tmp[$i]->people->firstname, 0, 1).'.'.mb_substr($tmp[$i]->people->patronymic, 0, 1).'. <br>';

                return $result;
            }, 'format' => 'html'
---
SELECT * FROM `people` `executor` WHERE `id` IN (48, 77)
SELECT * FROM `responsible` WHERE `document_order_id`=370
SELECT * FROM `people` WHERE `id`=57