views/document-order/view.php

SELECT * FROM `people` WHERE `id`=48
SELECT * FROM `expire` WHERE (`active_regulation_id`=370) AND (`expire_type`=1)
SELECT * FROM `regulation` WHERE `order_id`=370
---
                    $html = $html.Html::a('Положение "'.$res[$i]->name.'"', \yii\helpers\Url::to(['regulation/view', 'id' => $res[$i]->id])).'<br>';
                return $html;
            }, 'format' => 'raw'],
            ['label' => 'Ответственные по приказу', 'value' => function ($model) {
                $res = \app\models\work\ResponsibleWork::find()->where(['document_order_id' => $model->id])->all();
                $html = '';
                for ($i = 0; $i != count($res); $i++)
                    $html = $html.$res[$i]->people->secondname.' '.mb_substr($res[$i]->people->firstname, 0, 1).'. '.mb_substr($res[$i]->people->patronymic, 0, 1).'.<br>';
                return $html;
            }, 'format' => 'raw'],
            ['label' => 'Утратили силу документы', 'attribute' => 'expires', 'value' => function($model){
                $exp = \app\models\work\ExpireWork::find()->where(['active_regulation_id' => $model->id])->andWhere(['expire_type' => 1])->all();
                $res = '';
                foreach ($exp as $expOne)
                {
                    $order = \app\models\work\DocumentOrderWork::find()->where(['id' => $expOne->expire_order_id])->one();
                    $doc_num = 0;
                    if ($order->order_postfix == null)
                        $doc_num = $order->order_number.'/'.$order->order_copy_id;
                    else
                        $doc_num = $order->order_number.'/'.$order->order_copy_id.'/'.$order->order_postfix;
                    if ($expOne->expire_order_id !== null)
                        $res = $res . Html::a('Приказ №'.$doc_num, \yii\helpers\Url::to(['document-order/view', 'id' => $order->id])).'<br>';

                }

                $exp = \app\models\work\ExpireWork::find()->where(['active_regulation_id' => $model->id])->andWhere(['expire_type' => 1])->all();
                foreach ($exp as $expOne)
                {
                    $reg = \app\models\work\RegulationWork::find()->where(['id' => $expOne->expire_regulation_id])->one();
                    if ($expOne->expire_regulation_id !== null)