views/journal/index.php

SELECT * FROM `user` WHERE `id`=1
---
    //fdffd
    $parts = \app\models\work\TrainingGroupParticipantWork::find()->joinWith(['participant participant'])->where(['training_group_id' => $model->trainingGroup])->orderBy(['participant.secondname' => SORT_ASC])->all();
    $lessons = \app\models\work\TrainingGroupLessonWork::find()->where(['training_group_id' => $model->trainingGroup])->orderBy(['lesson_date' => SORT_ASC, 'id' => SORT_ASC])->all();
    $user = UserWork::find()->where(['id' => Yii::$app->user->identity->getId()])->one();

SELECT * FROM `visit` WHERE `id` IS NULL
---
        foreach ($lessons as $lesson)
        {
            //$visits = \app\models\work\VisitWork::find()->where(['training_group_lesson_id' => $lesson->id])->andWhere(['foreign_event_participant_id' => $part->participant->id])->one();
            $visits = \app\models\work\VisitWork::find()->where(['id' => $model->visits_id[$counter]])->one();