models/components/PdfWizard.php

SELECT * FROM `training_group` WHERE `id`=1329
SELECT * FROM `training_group_participant` WHERE `id`=15475
---
    static private function CertificatIntensives ($certificat_id, $destination, $path = null)
    {
        $certificat = CertificatWork::find()->where(['id' => $certificat_id])->one();
        $part = TrainingGroupParticipantWork::find()->where(['id' => $certificat->training_group_participant_id])->one();

SELECT * FROM `group_project_themes` WHERE `id`=621
SELECT * FROM `project_theme` WHERE `id`=646
---
            <p style="'.$styleDistance.'"></p>
            <p style="font-size: 16px;'.$style.'">в объеме '.$part->trainingGroupWork->trainingProgram->capacity .' академических часов, '.$genderVerbs[1].' проект</p>
            <p style="'.$styleDistance.'"></p>
            <p style="font-size: 20px; width: 800px;'.$style.'">"'.$part->groupProjectThemes->projectTheme->name.'"</p>