models/components/UserRBAC.php

    public static function CheckAccess($user_id, $action_type, $subsystem)
    {
        UserRBAC::CreateAccessArray();
        $access = AccessLevel::find()->where(['user_id' => $user_id])->all();
---
SELECT * FROM `access_level` WHERE `user_id`=1