models/components/WordWizard.php

        $table = $section->addTable();
        for ($i = 0; $i != count($res); $i++, $c++)
        {
            $fio = mb_substr($res[$i]->people->firstname, 0, 1) .'. '. mb_substr($res[$i]->people->patronymic, 0, 1) .'. '. $res[$i]->people->secondname;
---
SELECT * FROM `people` WHERE `id`=57


        foreach ($groups as $group)
        {
            $trGroup = $trG->where(['id' => $group->training_group_id])->one();
---
SELECT * FROM `training_group` WHERE `id`=26

            $teacherTrG = $teacher->where(['training_group_id' => $group->training_group_id])->one();
            $section->addText('Руководитель: ' . $teacherTrG->teacherWork->shortName);

            $programTrG = $program->where(['id' => $trGroup->training_program_id])->one();
---
SELECT * FROM `training_program` WHERE `id`=9

            $pasta = $pastaAlDente->where(['order_group_id' => $group->id])->all();
            for ($i = 0; $i < count($pasta); $i++)
            {
                $groupParticipant = $gPart->where(['id' => $pasta[$i]->group_participant_id])->one();
---
SELECT * FROM `training_group_participant` WHERE `id`=119