controllers/DocumentOrderController.php

SELECT * FROM `training_group` WHERE `id`=26
---
                echo '</td><td style="width: auto">';
                echo $part->where(['id' => $groupParticipant->participant_id])->one()->getFullName();
                echo '</td><td style="width: auto">';
                $gr = $stud->where(['id' => $groupParticipant->training_group_id])->one();