controllers/DocumentInController.php

SELECT * FROM `document_in` WHERE `id`='12'
---
    public function actionDeleteFile($fileName = null, $modelId = null)
    {

        $model = DocumentIn::find()->where(['id' => $modelId])->one();