controllers/ForeignEventParticipantsController.php

SELECT * FROM `foreign_event_participants` WHERE `id`='5193'
---
    protected function findModel($id)
    {
        if (($model = ForeignEventParticipants::findOne($id)) !== null) {