controllers/TrainingGroupController.php

    public function actionUpdateParticipant($id)
    {
        $model = TrainingGroupParticipantWork::find()->where(['id' => $id])->one();

        if ($model->load(Yii::$app->request->post())) {
            $model->save(false);
            $name = $model->participantWork->secondname . ' ' . $model->participantWork->firstname . ' ' . $model->participantWork->patronymic;
            $group = TrainingGroupWork::find()->where(['id' => $model->training_group_id])->one();
---
SELECT * FROM `training_group` WHERE `id`='7'