models/work/CertificatWork.php

    public function getParticipantGroup()
    {
        $part = TrainingGroupParticipantWork::find()->where(['id' => $this->training_group_participant_id])->one();
---
SELECT * FROM `training_group_participant` WHERE `id`=424
SELECT * FROM `training_group` WHERE `id`=17

    public function getParticipantProtection()
    {
        $part = TrainingGroupParticipantWork::find()->where(['id' => $this->training_group_participant_id])->one();
---
SELECT * FROM `training_group` WHERE `id`=1329
SELECT * FROM `training_group_participant` WHERE `id`=424

    public function getParticipantName()
    {
        $part = TrainingGroupParticipantWork::find()->where(['id' => $this->training_group_participant_id])->one();
---
SELECT * FROM `training_group_participant` WHERE `id`=15475
SELECT * FROM `training_group` WHERE `id`=1329

    public function getCertificatTemplateName()
    {
        $templates = CertificatTemplatesWork::find()->where(['id' => $this->certificat_template_id])->one();
---
SELECT * FROM `certificat_templates` WHERE `id`=6