models/work/ForeignEventWork.php

    public function getParticipantCount()
    {
        return count(TeacherParticipant::find()->where(['foreign_event_id' => $this->id])->all());
---
SELECT * FROM `teacher_participant` WHERE `foreign_event_id`=23

    public function getErrorsWork()
    {
        $errorsList = ForeignEventErrorsWork::find()->where(['foreign_event_id' => $this->id, 'time_the_end' => NULL, 'amnesty' => NULL])->all();
        $result = '';
        foreach ($errorsList as $errors)
        {
            $error = ErrorsWork::find()->where(['id' => $errors->errors_id])->one();
---
SELECT * FROM `errors` WHERE `id`=26