models/work/ForeignEventWork.php

SELECT * FROM `foreign_event` WHERE `id`=23
---
    public function getOrderBusinessTripString()
    {
        $order = \app\models\work\DocumentOrderWork::find()->where(['id' => $this->order_business_trip_id])->one();