models/work/ForeignEventParticipantsWork.php

SELECT * FROM `participant_files` WHERE `participant_id`=5193
---
    public function getDocuments()
    {
        $docs = ParticipantFiles::find()->where(['participant_id' => $this->id])->all();

SELECT * FROM `participant_achievement` WHERE `participant_id`=5193
---
    public function getAchievements()
    {
        $achieves = ParticipantAchievement::find()->where(['participant_id' => $this->id])->all();

SELECT * FROM `teacher_participant` WHERE `participant_id`=5193
---
    public function getEvents()
    {
        $events = TeacherParticipant::find()->where(['participant_id' => $this->id])->all();

SELECT * FROM `training_group_participant` WHERE `participant_id`=5193
---
    public function getStudies()
    {
        $events = TrainingGroupParticipant::find()->where(['participant_id' => $this->id])->all();