models/work/OrderGroupParticipantWork.php

    public function getParticipantAndGroup()
    {
        $groupParticipant = TrainingGroupParticipantWork::find()->where(['id' => $this->group_participant_id])->one();
        $participant = ForeignEventParticipantsWork::find()->where(['id' => $groupParticipant->participant_id])->one();
        $group = TrainingGroupWork::find()->where(['id' => $groupParticipant->training_group_id])->one();
---
SELECT * FROM `training_group_participant` WHERE `id`=119
SELECT * FROM `training_group` WHERE `id`=26