models/work/PeopleWork.php

SELECT * FROM `position` WHERE `id`=30
---
    public function getFullNameBranch($branch_id)
    {
        $newPosition = "";
        $positions = PeoplePositionBranch::find()->where(['branch_id' => $branch_id])->andWhere(['people_id' => $this->id])->all();
        if (count($positions) == 0) return $this->secondname.' '.$this->firstname.' '.$this->patronymic;
        else if (count($positions) == 1) return $this->secondname.' '.$this->firstname.' '.$this->patronymic.' ('.$positions[0]->position->name.')';

SELECT * FROM `people_position_branch` WHERE `people_id`=7
---
    public function getFullName()
    {
        $positions = '';
        $pos = PeoplePositionBranch::find()->where(['people_id' => $this->id])->all();

SELECT * FROM `people` WHERE `id`=8
---
    public function beforeSave($insert)
    {
        if (strlen($this->short) > 2)
        {
            $current = PeopleWork::find()->where(['id' => $this->id])->one();