models/work/TrainingGroupWork.php

SELECT * FROM `training_program` WHERE `id` IS NULL
---
    public function getProgramNameNoLink()
    {
        $prog = TrainingProgramWork::find()->where(['id' => $this->training_program_id])->one();