models/work/TrainingProgramWork.php

SELECT * FROM `focus` WHERE `id`=1
---
    public function getStringFocus()
    {
        return Focus::find()->where(['id' => $this->focus_id])->one()->name;