models/work/TrainingGroupWork.php

SELECT * FROM `training_program` WHERE `id`=443
---
    public function getProgramName()
    {
        $prog = TrainingProgramWork::find()->where(['id' => $this->training_program_id])->one();

SELECT * FROM `branch` WHERE `id`=1
---
    public function getBranchNameNoLink()
    {
        $branch = BranchWork::find()->where(['id' => $this->branch_id])->one();

SELECT `visit`.* FROM `visit` LEFT JOIN `training_group_lesson` `lesson` ON `visit`.`training_group_lesson_id` = `lesson`.`id` WHERE `lesson`.`training_group_id`=1389
---
    public function getVisitsError()
    {
        $visits = Visit::find()->joinWith(['trainingGroupLesson lesson'])->where(['lesson.training_group_id' => $this->id])->all();

SELECT `order_group_participant`.* FROM `order_group_participant` LEFT JOIN `training_group_participant` `group_participant` ON `order_group_participant`.`group_participant_id` = `group_participant`.`id` WHERE (`group_participant`.`participant_id`=5093) AND (`group_participant`.`training_group_id`=1389)
SELECT `personal_data_foreign_event_participant`.* FROM `personal_data_foreign_event_participant` LEFT JOIN `foreign_event_participants` `foreignEventParticipant` ON `personal_data_foreign_event_participant`.`foreign_event_participant_id` = `foreignEventParticipant`.`id` WHERE (`foreignEventParticipant`.`id`=5093) AND (`personal_data_foreign_event_participant`.`status`=1)
---
    public function getParticipantNames()
    {
        $parts = TrainingGroupParticipantWork::find()->where(['training_group_id' => $this->id])->all();
        $orders = OrderGroupParticipantWork::find()->joinWith(['groupParticipant group_participant']);
        $result = '';
        foreach ($parts as $part)
        {
            $pdDatabase = PersonalDataForeignEventParticipantWork::find()->joinWith(['foreignEventParticipant foreignEventParticipant'])->where(['foreignEventParticipant.id' => $part->participant_id])->andWhere(['personal_data_foreign_event_participant.status' => 1])->all();

SELECT * FROM `order_group` WHERE `training_group_id`=1389
---
    public function getOrdersName()
    {
        /*$orders = OrderGroupWork::find()->where(['training_group_id' => $this->id])->all();
        $result = '';
        foreach ($orders as $order)
        {
            $result .= Html::a($order->documentOrderWork->fullName, \yii\helpers\Url::to(['document-order/view', 'id' => $order->documentOrderWork->id])).'<br>';
        }
        return $result;*/
        $parts = TrainingGroupParticipantWork::find()->where(['training_group_id' => $this->id])->all();
        $partSet = [];
        foreach ($parts as $part) $partSet[] = $part->id;
        $pasta = OrderGroupParticipantWork::find()->where(['IN','group_participant_id', $partSet])->all();
        $pastaSet = [];
        foreach ($pasta as $macaroni) $pastaSet[] = $macaroni->order_group_id;

SELECT * FROM `branch` WHERE `id`=2
---
    public function getBranchWork()
    {
        $branch =  BranchWork::find()->where(['id' => $this->branch_id])->one();

SELECT * FROM `errors` WHERE `id`=36
---
    public function getErrorsWork()
    {
        $errorsList = GroupErrorsWork::find()->where(['training_group_id' => $this->id, 'time_the_end' => NULL, 'amnesty' => NULL])->all();
        $result = '';
        foreach ($errorsList as $errors)
        {
            $errorName = ErrorsWork::find()->where(['id' => $errors->errors_id])->one();