models/work/TrainingProgramWork.php

    public function getAllowRemote()
    {
        //return $this->allow_remote == 0 ? 'Нет' : 'Да';
        return AllowRemoteWork::find()->where(['id' => $this->allow_remote_id])->one()->name;
---
SELECT * FROM `allow_remote` WHERE `id`=2

    public function getBranchs()
    {
        $branchs = BranchProgram::find()->where(['training_program_id' => $this->id])->all();
---
SELECT * FROM `branch_program` WHERE `training_program_id`=556

    public function getThemesPlan()
    {
        $tp = ThematicPlan::find()->where(['training_program_id' => $this->id])->all();
---
SELECT * FROM `thematic_plan` WHERE `training_program_id`=556

    public function getStringFocus()
    {
        return Focus::find()->where(['id' => $this->focus_id])->one()->name;
---
SELECT * FROM `focus` WHERE `id`=1