views/docs-out/index.php

        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'summary' => false,
        'columns' => [

            ['attribute' => 'document_number','label' => '№ п/п', 'value' => function($model){
                if ($model->document_postfix == null)
                    return $model->document_number;
                else
                    return $model->document_number.'/'.$model->document_postfix;
            }],
            ['attribute' => 'document_date','label' => 'Дата документа'],
            ['attribute' => 'document_theme','label' => 'Тема документа'],
            ['attribute' => 'companyName','label' => 'Кому адресован', 'value' => function ($model) {
                if ($model->position_id == 7)
                    return $model->company->name;
                return $model->position->name.' '.$model->company->name;
            },
            ],
            ['attribute' => 'signedName','label' => 'Кем подписан', 'value' => function ($model) {
                return $model->signed->secondname.' '.mb_substr($model->signed->firstname, 0, 1).'.'.mb_substr($model->signed->patronymic, 0, 1).'.';
            },
            ],
            ['attribute' => 'executorName','label' => 'Кто исполнитель', 'value' => function ($model) {
---
SELECT * FROM `company` WHERE `id`=8
SELECT * FROM `position` WHERE `id` IN (1, 11)