views/temporary/t-click/view.php

            echo Html::a('ЖМЯК', ['update', 'id' => $model->id], ['class' => 'btn btn-danger', 'style' => 'height: 70%; width: 80%; line-height: 120px']);
        else
        {
            $users = TClick::find()->where(['!=', 'name', 'Админ'])->orderBy(['time' => SORT_ASC])->all();
---
SELECT * FROM `t_click` WHERE `name` != 'Админ' ORDER BY `time`