views/document-in/_form.php

SELECT * FROM `people`
---


    <?php
    $people = \app\models\common\People::find()->all();

SELECT * FROM `position`
---
        if ($model->correspondent_id !== null)
        {
            echo '<div id="corr_div1" hidden="true">';
                $position = \app\models\common\Position::find()->all();

SELECT * FROM `company`
---
            echo '</div>';

            echo '<div id="corr_div2" hidden="true">';
                $company = \app\models\common\Company::find()->all();

SELECT * FROM `send_method`
---
    <?= $form->field($model, 'document_theme')->textInput(['maxlength' => true])->label('Тема документа') ?>

    <?php
    $sendMethod= \app\models\common\SendMethod::find()->all();