views/document-in/index.php

                else
                    return ['class' => 'warning'];
            },
            'columns' => [

                ['attribute' => 'id', 'label' => '№ п/п', 'value' => function($model){
                    if ($model->local_postfix == null)
                        return $model->local_number;
                    else
                        return $model->local_number.'/'.$model->local_postfix;
                }],
                ['attribute' => 'local_date', 'label' => 'Дата поступления<br>документа', 'encodeLabel' => false],
                ['attribute' => 'real_date', 'label' => 'Дата входящего<br>документа', 'encodeLabel' => false],
                ['attribute' => 'real_number', 'label' => 'Рег. номер<br>входящего док.', 'encodeLabel' => false],

                ['attribute' => 'companyName', 'label' => 'Наименование<br>корреспондента', 'encodeLabel' => false, 'value' => function ($model) {
                    return $model->company->name;
                }],
                ['attribute' => 'correspondentName', 'label' => 'Кем подписан', 'value' => 'correspondent.shortName'],
                ['attribute' => 'document_theme', 'label' => 'Тема документа', 'encodeLabel' => false],
                ['attribute' => 'sendMethodName','label' => 'Способ получения', 'value' => 'sendMethod.name'],
                ['attribute' => 'needAnswer', 'label' => 'Ответ', 'value' => function($model){
                   $links = \app\models\common\InOutDocs::find()->where(['document_in_id' => $model->id])->one();
                   if ($links == null)
                       return '';
                   if ($links->document_out_id == null)
                       return 'Требуется ответ';
                   else
                       return Html::a('Исходящий документ "'.\app\models\common\DocumentOut::find()->where(['id' => $links->document_out_id])->one()->document_theme.'"',
                           \yii\helpers\Url::to(['docs-out/view', 'id' => \app\models\common\DocumentOut::find()->where(['id' => $links->document_out_id])->one()->id]));
                }, 'format' => 'raw'],
---
SELECT * FROM `send_method` WHERE `id`=1
SELECT * FROM `in_out_docs` WHERE `document_in_id`=9