views/document-in/index.php

SELECT * FROM `company` WHERE `id`=1
SELECT * FROM `people` WHERE `id`=2
---

    <?php

    $gridColumns = [
        ['attribute' => 'fullNumber', 'label' => '№ п/п', 'value' => function($model){
            if ($model->local_postfix == null)
                return $model->local_number;
            else
                return $model->local_number.'/'.$model->local_postfix;
        }],
        ['attribute' => 'local_date', 'label' => 'Дата поступления<br>документа', 'encodeLabel' => false],
        ['attribute' => 'real_date', 'label' => 'Дата входящего<br>документа', 'encodeLabel' => false],
        ['attribute' => 'real_number', 'label' => 'Рег. номер<br>входящего док.', 'encodeLabel' => false],

        ['attribute' => 'companyName', 'label' => 'Наименование<br>корреспондента', 'encodeLabel' => false, 'value' => function ($model) {
            return $model->company->name;
        }],
        ['attribute' => 'document_theme', 'label' => 'Тема документа', 'encodeLabel' => false],
        ['attribute' => 'sendMethodName','label' => 'Способ получения', 'value' => 'sendMethod.name'],
        ['attribute' => 'needAnswer', 'label' => 'Ответ', 'value' => function($model){
            $links = \app\models\work\InOutDocsWork::find()->where(['document_in_id' => $model->id])->one();


            if ($links == null)
                return '';
            if ($links->document_out_id == null)
            {
                if ($links->people == null)
                {
                    if ($links->date == null)
                        return 'Требуется ответ';
                    else
                        return 'До '.$links->date;
                }
                return 'До '.$links->date.' от '.$links->peopleWork->shortName;
            }

            else
                return 'Исходящий документ "'.\app\models\work\DocumentOutWork::find()->where(['id' => $links->document_out_id])->one()->document_theme.'"';
