views/document-in/view.php

SELECT * FROM `company` WHERE `id`=3
SELECT * FROM `position` WHERE `id`=3
---

    <?= DetailView::widget([
        'model' => $model,
        'attributes' => [
            ['label' => '№ п/п', 'attribute' => 'id', 'value' => function($model){
                if ($model->local_postfix == null)
                    return $model->local_number;
                else
                    return $model->local_number.'/'.$model->local_postfix;
            }],
            ['label' => 'Дата поступления документа', 'attribute' => 'local_date'],
            ['label' => 'Дата входящего документа', 'attribute' => 'real_date'],
            ['label' => 'Регистрационный номер входящего документа', 'attribute' => 'real_number'],
            ['label' => 'ФИО корреспондента', 'attribute' => 'correspondent_id', 'value' => $model->correspondent->secondname.' '.mb_substr($model->correspondent->firstname, 0, 1).'. '.mb_substr($model->correspondent->patronymic, 0, 1).'.'],
            ['label' => 'Должность корреспондента', 'attribute' => 'position_id', 'value' => function($model){
                if ($model->position_id == 7)
                    return '';
                return $model->position->name;
            }],
            ['label' => 'Организация корреспондента', 'attribute' => 'company_id', 'value' => $model->company->name],
            ['label' => 'Тема документа', 'attribute' => 'document_theme'],
            ['label' => 'Способ получения', 'attribute' => 'send_method_id', 'value' => $model->sendMethod->name],
            ['label' => 'Скан документа', 'attribute' => 'scan', 'value' => function ($model) {
                return Html::a($model->scan, \yii\helpers\Url::to(['document-in/get-file', 'fileName' => $model->scan, 'modelId' => $model->id]));
                //return Html::a($model->Scan, 'index.php?r=docs-out/get-file&filename='.$model->Scan);

SELECT * FROM `in_out_docs` WHERE `document_in_id`=12
---
                //return Html::a($model->Scan, 'index.php?r=docs-out/get-file&filename='.$model->Scan);
            }, 'format' => 'raw'],
            ['label' => 'Ключевые слова', 'attribute' => 'key_words'],
            ['attribute' => 'needAnswer', 'label' => 'Ответ', 'value' => function($model){
                $links = \app\models\common\InOutDocs::find()->where(['document_in_id' => $model->id])->one();
                if ($links == null)
                    return '';
                if ($links->document_out_id == null)
                    return 'Требуется ответ';
                else
                    return Html::a('Входящий документ "'.\app\models\common\DocumentOut::find()->where(['id' => $links->document_out_id])->one()->document_theme.'"',
                        \yii\helpers\Url::to(['docs-out/view', 'id' => \app\models\common\DocumentOut::find()->where(['id' => $links->document_out_id])->one()->id]));
            }, 'format' => 'raw'],