views/document-in/view.php

    <?= DetailView::widget([
        'model' => $model,
        'attributes' => [
            ['label' => '№ п/п', 'attribute' => 'id'],
            ['label' => 'Дата поступления документа', 'attribute' => 'local_date'],
            ['label' => 'Дата входящего документа', 'attribute' => 'real_date'],
            ['label' => 'Регистрационный номер входящего документа', 'attribute' => 'real_number'],
            ['label' => 'ФИО корреспондента', 'attribute' => 'correspondent_id', 'value' => $model->correspondent->secondname.' '.mb_substr($model->correspondent->firstname, 0, 1).'. '.mb_substr($model->correspondent->patronymic, 0, 1).'.'],
            ['label' => 'Должность корреспондента', 'attribute' => 'position_id', 'value' => function($model){
                if ($model->position_id == 7)
                    return '';
                return $model->position->name;
            }],
            ['label' => 'Организация корреспондента', 'attribute' => 'company_id', 'value' => $model->company->name],
            ['label' => 'Тема документа', 'attribute' => 'document_theme'],
            ['label' => 'Способ получения', 'attribute' => 'send_method_id', 'value' => $model->sendMethod->name],
            ['label' => 'Скан приказа', 'attribute' => 'scan', 'value' => function ($model) {
                return Html::a($model->scan, \yii\helpers\Url::to(['document-in/get-file', 'fileName' => $model->scan, 'modelId' => $model->id]));
                //return Html::a($model->Scan, 'index.php?r=docs-out/get-file&filename='.$model->Scan);
            }, 'format' => 'raw'],
            ['label' => 'Приложения', 'attribute' => 'applications'],
            ['label' => 'Ключевые слова', 'attribute' => 'key_words'],
            ['label' => 'Регистратор документа', 'attribute' => 'register_id', 'value' => $model->register->secondname.' '.mb_substr($model->register->firstname, 0, 1).'. '.mb_substr($model->register->patronymic, 0, 1).'.'],
        ],
---
SELECT * FROM `send_method` WHERE `id`=1