models/common/People.php

    public function getFullName()
    {
        return $this->secondname.' '.$this->firstname.' '.$this->patronymic.' ('.$this->position->name.')';
---
SELECT * FROM `position` WHERE `id`=1