models/common/User.php

SELECT * FROM `user` WHERE `id`=31
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);