views/certificat/_form.php

    $cIds = [];
    foreach($cert as $one) $cIds[] = $one->training_group_participant_id;

    $tps = TrainingGroupParticipantWork::find()->joinWith(['trainingGroup trainingGroup'])->where(['trainingGroup.archive' => 0])->andWhere(['status' => 0])->andWhere(['NOT IN', 'training_group_participant.id', $cIds])->all();
---
SELECT `training_group_participant`.* FROM `training_group_participant` LEFT JOIN `training_group` `trainingGroup` ON `training_group_participant`.`training_group_id` = `trainingGroup`.`id` WHERE (`trainingGroup`.`archive`=0) AND (`status`=0) AND (`training_group_participant`.`id` NOT IN (424, 426, 427, 448, 448, 449, 450, 451, 452, 453, 425, 428, 429, 444, 445))