views/training-group/_form.php

    $counterPhp = 0;

    if ($model->training_program_id !== null)
        $progs = \app\models\work\TrainingProgramWork::find()->orderBy(['name' => SORT_ASC])->andWhere(['actual' => 1])->orWhere(['id' => $model->training_program_id])->all();
---
SELECT * FROM `training_program` WHERE (`actual`=1) OR (`id`=368) ORDER BY `name`