controllers/temporary/TClickController.php

SELECT * FROM `t_click` WHERE `id`='2'
UPDATE `t_click` SET `time`='11:05:57' WHERE `id`=2
---
    public function actionUpdate($id)
    {
        $user = TClick::find()->where(['id' => $id])->one();
        $user->time = date('h:i:s');
        $user->save();

SELECT * FROM `t_click` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = TClick::findOne($id)) !== null) {